In [1]:
import numpy as np
from pandas import Series, DataFrame 
import pandas as pd

In [5]:
dframe = DataFrame({'altitude':[315,215,354],
                     'city':['alma','brian head','fox']})

In [6]:
dframe

   altitude        city
0       315        alma
1       215  brian head
2       354         fox

In [7]:
state_map = {'alma':'colorado', 'brian head':'utah', 'fox':'wyoming'}

In [8]:
dframe['state'] = dframe['city'].map(state_map)

In [9]:
dframe

   altitude        city     state
0       315        alma  colorado
1       215  brian head      utah
2       354         fox   wyoming